cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'coreutils'
brew 'coursier/formulas/coursier'
brew 'exercism'
brew 'openjdk@8'
brew 'openssl'
brew 'readline'
brew 'postgresql'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
# brew 'sbt' # had problems with Java version when installing sbt via Homebrew; used skdman instead
brew 'tmux'
brew 'vercel-cli'
brew 'wget'

cask '1password'
cask 'authy'
cask 'cleanmymac'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'kap'
cask 'loom'
cask 'notion'
cask 'postman'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask 'zoom'
