cask_args appdir: '/Applications'

tap 'homebrew/bundle'
# tap 'johanhaleby/kubetail'
tap 'mongodb/brew'

brew 'exercism'
brew 'go'
# brew 'k6'
# brew 'kubetail'
brew 'mongodb-community'
brew 'mongodb-database-tools'
brew 'postgresql'
brew 'rbenv'
brew 'ruby-build'
brew 'terraform'
# brew 'vegeta'
brew 'vercel-cli'
brew 'yarn'
brew 'yt-dlp'

cask '1password'
cask 'authy'
cask 'centered'
cask 'charles'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'gimp'
cask 'google-chrome'
cask 'iterm2'
cask 'linear-linear'
# cask 'loom'
cask 'mongodb-compass'
cask 'notion'
# cask 'obs' # webcam
cask 'postman'
cask 'raycast'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'todoist'
cask 'visual-studio-code'
cask 'zoom'
