cask_args appdir: '/Applications'

tap 'homebrew/bundle'
# tap 'johanhaleby/kubetail'
tap 'mongodb/brew'

brew 'asdf'
brew 'buf'
brew 'exercism'
brew 'gh'
brew 'go'
brew 'golang-migrate'
brew 'golangci-lint'
brew 'grpcurl'
# brew 'k6'
# brew 'kubetail'
brew 'kubectl'
brew 'jq'
brew 'mongodb-community'
brew 'mongodb-database-tools'
brew 'postgresql'
brew 'pnpm'
brew 'protobuf'
brew 'rbenv'
brew 'ruby-build'
brew 'shellcheck'
brew 'terraform'
# brew 'vegeta'
brew 'vercel-cli'
brew 'yarn'
brew 'yj'
brew 'yq'
brew 'yt-dlp'

cask '1password'
cask '1password/tap/1password-cli'
cask 'arc'
cask 'authy'
cask 'charles'
cask 'dbeaver-community'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'gimp'
cask 'google-chrome'
cask 'iterm2'
cask 'linear-linear'
cask 'loom'
cask 'mongodb-compass'
cask 'notion'
cask 'obs' # webcam
cask 'pgadmin4'
cask 'postman'
cask 'raycast'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'todoist'
cask 'visual-studio-code'
cask 'zoom'
